{"about":{"title":"About","description":"","content":"Connect\nEmail: pankaj.rasgania25@gmail.comFacebook: https:\/\/www.facebook.com\/pankajrasgania.officialTelegram: https:\/\/t.me\/pankajrasganiaTwitter: https:\/\/twitter.com\/PankajRasgania\nCopyright information\nEverything on this website, unless otherwise stated, is protected by copyright. Users are prohibited from modifying, copying, distributing, transmitting, displaying, publishing, selling, licensing, creating derivative works or using any Content available on or through the Site for commercial or public purposes.\nImages used on this websites are public domain images which are licensed for reuse. Some useful website to find such public domain copyleft images are\n\nwww.pixabay.com \nwww.unsplash.com\n"},"little-things":{"title":"Little things","description":"","content":"There are things that we strive for and there are things that make us happy. Most often we think that both of them are overlapping. Surely, we strive for things that will make us happy, but in this constant pursuit of happiness, some “little things” eludes us that do makes us happy but we often don’t strive for them. It is these little things that provide momentary doses of joy and content, and that keeps us going for larger pursuits.\nWhat are little things?\nIt is very difficult to define or describe little things. For start, they are not big things, that we desperately plan for like getting that job, marriage, buying a house, etc. They are those things that come in the form of episodes of happiness interspersed among the big things.\nWatching our favorite cartoon as a child, wearing our favorite dress in school on birthday, catching the smile of our crush, playing antakshari during power outages, making ice-cream in our new fridge, buying our first phone, spending our first salary, meeting old college friends, watching movie with spouse after a long day, compliments on the new dress, getting the much needed solitude, and laughing together with family are some of the little things.\nWhy little things matter?\nLittle things matter for the simple reason that they make us happy. And we do almost always appreciate little things when they happen. But we don’t actively make efforts to create those little moments. Sometimes in the pursuit of big things, we forget about little things. We defer them, ignore them or simply omit them, which can make us unfulfilled and unsatisfactory.\nMan is a passionate animal. Even achieving the biggest of big things will not make us perpetually happy. We always crave for more. While both big and little things make us happy, although, in different proportions, there is one fundamental difference between the two. Little moments can be created more easily without much efforts. You can right now create those moments, bringing smiles on the face of your loved ones.\nTherefore, they hold the key to maximization of happiness. They hold the key to every relationship. They hold the key to personal satisfaction.\nIt is these little things that make us enjoy the journey.\nThe end\nWell, this post is short, but there is no measure of the impact that this has had on me. I don’t have enough writing skills to make it more appealing, so I request you to think over it."},"the-dilemma-of-empathy":{"title":"The dilemma of empathy","description":"","content":"The title may seem a little unusual. How can there be dilemma with empathy, when it is such a revered quality?\nEmpathy is certainly a desirable trait. However, it may not always work in a manner that we desire. It’s consequences can sometimes be against the interest of the individual, or the society. In that case, there arises a dilemma, should we take action on the basis of the empathy or not.\nThe curious case of Lakshmi\nIt was a happening evening in Connaught Place, Delhi when we met Lakshmi. She was a young girl, 10 years old, who was selling balloons. She came to us and asked us to buy her a blanket as it was a cold evening in winters of Delhi.\nNormally, while helping such kids who are forced to beg due to unfortunate circumstances, there is a thought which often holds us back. What if the money that we give to them is not used for their welfare? What if they are controlled by an organised criminal group, and all the money that these kids receive gets snatched by their captors? What if our empathy is being exploited by such criminal groups, and young children are being trafficked precisely because of this reason? What if our generous supply of empathetic alms creates a demand of trafficked children on traffic signals?\nThis creates a dilemma – should we help them with money or not?\nWhen Lakshmi asked us for the blanket, we were also in this dilemma. However, in this case, she was not asking for money, but a blanket, which had lower chances of misuse and getting snatched away by her captor (if any)? We wanted to help her but there one major problem. We were not sure how we should help.\nTo resolve this problem, we decided to know more about Lakshmi.\nWe: Do you go to school?Lakshmi: No, but a didi often comes to teach us.We: Whom do you live with?Lakshmi: I live alone.We: Where are your parents?Lakshmi: My parents are dead.\nWe felt very sorry for her situation, after learning that she is an orphan and lives alone without any support. This raised our curiosity too and we wanted to know about her more, as we could not even imagine how Lakshmi was able to make her ends meet. We continued our conversation.\nWe: Where do you live?Lakshmi: I live near the Hanuman Mandir (showing the direction).We: Where do you eat?Lakshmi: There is a dhaba nearby Hanuman Mandir which gives a meal for Rs 15.We: Where do you get money from?Lakshmi: I sell these balloons. I buy food and clothes from that money.\nWe asked her more questions – about how she handles her day to day challenges. To each of our question, she gave precise answer with great confidence and optimism. The dilemma that we had at the starting had died down at this point, and we wanted to help her.\nBeing unsure of how we can help, we initially gave her some money and she left. Later, we realized that we could do more. Having the privilege of education and information, it was our duty to connect Lakshmi with institutional help. We decided to call Child Helpline (1098) and do our part in ensuring that Lakshmi gets a childhood that everyone deserves. We informed the Helpline officials about Lakshmi and our location. In between, we tracked Lakshmi again, and asked her about whether she would like to go to school, to which she replied yes. Then we told her that we are calling Child Helpline and they will provide her a shelter and education. She became anxious after hearing this, and pleaded that she doesn’t want to go there. We tried explaining to her about how it can be beneficial to her and she could go to school, but all in vain. She was not ready to listen and ran away.\nWe were perplexed. What had just happened? Why Lakshmi is refusing to get rehabilitation while being in such difficult circumstances? Our dilemma rechristened itself in the form of doubt.\nThe doubt was whether there was any falsity in Lakshmi’s narration. We decided to investigate further. We found another girl who was selling balloons nearby. We asked her whether she knew Lakshmi, to which she replied yes. We inquired a"},"discovering-zeroth-mode-of-thinking":{"title":"Discovering zeroth mode of thinking","description":"","content":"Everybody thinks, and thanks to that humans have been able to build a civilization that is moving in the direction of increasing freedoms and prosperity. However, human thought process is severely constrained and conditioned due to socialization, environment and history.\nA very interesting theory by sociologist G.H.Mead in his work Mind, Self and Society argues that in order to think we need symbols that represent concepts. The symbols are learned from the society, primarily in the form of language. In a way, it argues that thinking is possible only if there exist a society. As a corollary, we can argue that thinking is constrained by the ideas and concepts prevalent in the society. It is also consistent with various neurological studies that have found that different languages wire neurons differently and it affects how we think. The Hollywood movie Arrival (2016) stretched it too far where an alien language had an altogether different concept of time, and the protagonist who learned this language could see stills from the future. Well it’s just science fiction, but the key point here is that society influences our thinking (both ability and content). Take for example democracy and human rights which have become common sense now, didn’t make sense to humans thousands of years ago.\nHowever, the theory seems only half of the truth. It presupposes the existing of society for thinking. But without “thinking” a complex organisation such as society cannot emerge. So we’re stuck with the — chicken and the egg problem. Perhaps a more satisfying proposition by Mead is that both thinking ability and society co-evolved through dialectic process.\nTherefore we can argue that it is possible to create new concepts through thinking which hitherto never existed in society. This is what the so called ‘thinkers’ like Socrates, Plato, Hobbes, Mills etc. did. It requires breaking the constraints imposed by the existing concepts (or society) and ‘thinking’ while assuming that such constraining concepts never existed. I like to call this mode of thinking as ‘zeroth mode of thinking’.\nWhat comes closer to this ‘zeroth’ mode is the thought experiment by John Rawls where he argues that in order to envisage a just social system one must put on the ‘veil of ignorance’ i.e. the thinker doesn’t know what class will he belong to. It is a great tool to design social systems and correct injustices.\nThis idea of ignoring the present conditions, or putting on the ‘veil of ignorance’, or entering the ‘zeroth mode of thinking’ has vast application not just in social sciences and philosophy but in science, mathematics, and all other spheres.\nZeroth mode\nUsing zeroth mode of thinking requires ignoring elements which are often too sacred to us. For example, on language issues we can ignore the identity aspect of it and focus only on technological aspect of it, on genders issues we can ignore the difference between sexes to design a gender-equal society, and so on.\nHowever, there is a catch. In the process of overlooking certain elements we may adventure into a direction which is totally opposite to the current notions development (which is also a form of constraint on thinking). Further the new concept that we evolve may not be practically possible to implement (such as completely gender neutral laws in 20th Century). Thus, such a thinker risks being a deviant and may stand accused of blasphemy — by deconstructing the sacred concepts of society.\nLimitations\nAs discussed above, thinking cannot be completely independent of the society. This is the single most limitation of this approach. Therefore, in order to think in zeroth mode, we need to think about a subject which itself is a concept given by society. So essentially what we are doing is, prioritizing some concepts and ignoring all others. If we ignore all the concepts, we risk falling into the realm of Nihilism.\nThinking about social organisation\nTo begin with we need to choose some concepts which will become p"},"unity-of-contradictions-and-perfectionism":{"title":"Unity of contradictions and perfectionism","description":"","content":"We have learned to experience in terms of binaries — positive and negative; right and wrong; goodness and evil; and so on. But is this the correct way or say ‘the most realistic’ way to look at things? In my opinion, binary classification is necessary yet unnecessary. Seems contradictory ?? Well, that I think is the true nature of reality, a “perfect” combination of opposite and contradictory binaries.\nThe true picture\nInstead of binary, reality is a spectrum of infinite possibilities with contradictory end points. It is true that we can always classify things into two binary opposites but no actual thing can be found at the binary ends. Almost all elements of reality exists in between. For example, there is nothing that is 100% right and there is nothing that is 100% wrong. Most often the contradictory elements exists together. Perhaps the yin-yang symbol describes it much better than words.\nThus co-existence of contradictory elements is natural and to some extent desirable. In fact, as per Hegel the constant struggle between the two contradictory elements (ideas) is what moves society forward.\nHolding contradictory thoughts simlutaneously is not therefore a sign of dishonesty, but a natural recognition of complexity of reality and a rejection of purely binary modes of perspectives.\nPerfectionism\nPerfectionism is the ideal (and non-achievable) balance between the two contradictory elements. At this perfect point on the spectrum, the concept of the contradictory binaries loses its relevance as both are present in equal amounts. It is a non-stable equilibrium point. It is not-achievable but desirable, hence one should direct oneself towards this point.\nApplication\n\nRight and wrong: These are highly subjective concepts. Even if we all agree on universal concept of right and wrong, most of the righteous actions contains some wrong elements and vice versa.\nLeft and Right: The perfect balance between the forces of preservation and recreation hold the key for progress of societies. What is left today may become right in near future. So appreciate and participate on both sides.\nSocialism and Capitalism: Both have some good and bad elements. Having a combination of the two for maximising good and minimising bad elements holds the key.\nIdealism and Realism: This is a classic dilemma not just in public policy but in ethics also where Idealism is desired but Realism is the only option. A perfect mixture holds the potential to do wonders. An ideal goal with realistic path seems the way to go.\n\nAll of this may sound simplistic and straightforward, but it very hard to practise in real life. We have been taught to think in binaries and it takes a lot of efforts to unlearn it.\nSo embrace the contradictions and strive for perfection."},"ego":{"title":"Ego","description":"","content":"The word ‘ego’ has been used in a number of ways, ranging from defining a characteristic of personality (self-centeredness) to, in a larger sense, defining the whole of self.\nIn this post, I will use the word ‘ego’ to mean the boundary that a person creates to determine who matters and who doesn’t. The people outside the ego can be referred to as the outsiders.\nAt birth, there is only person within the ego. But as a person grows this boundary (or ego) expands as more and more people come to matter to us for e.g. parents, siblings, friends, etc. However this boundary is not a binary division, rather it is fuzzy and continues. At all times, oneself matters the most, then comes the family and then comes the friends and so on. The extent of ego has a significant influence on the person’s behaviour. All actions will be taken in order to maximize the gains for one’s ego. So self-interest comes first, followed by family’s interest, followed by friends’s interest, followed by colleague’s interest, followed by community’s interest, followed by nation’s interest, followed by the interest of the humanity, followed by the interest of life.\nA typically behaviour associated with ego is hypocrisy. It means that we have different standards for ego and outsiders. The different standards (more stringent) for outsiders arise due to the fact that they don’t matter to us, and we don’t care about their well being. Consider for example, the loss of lives in the ongoing civil in Syria. How does it affect you? Does it affect you the same way if it was happening in your own nation, or god forbid if one of your loved ones was involved? Probably a little less. People who are largely empathetic or care about the larger lot of humanity, simply have a larger extent of ego.\nHowever, as addressed earlier, ego is subject to change and so is the behaviour. The structure of the ego is the primarily the result of one’s experience, especially in the childhood. This means that we are not predestined to have a particular structure of ego. It means that there is a possibility of living in a less hypocritical world."},"godly-excuse":{"title":"Godly excuse","description":"","content":"As a person we always tend to hide our negatives and insecurities. Self reflection is perhaps not the strongest trait of human personalities. That is why, when we are made to confront our weak points, we look for excuses. And what’s a better excuse than the inability to control, that things are divinely decided. Following this tendency, we make our weak points the strong points of a divine creature and call it God. Then we excuse ourselves that it has such qualities because it is God.\nAlas, a breakdown of this arrangement may occur if we happen to meet a human with such qualities. But then we elevate such persons to the pedestal of God or atleast higher than ourselves, and then again excuse ourselves that we cannot achieve such qualities because we are not God.\nSo,\nDoes divinity exist? Certainly not, only human exists.\nDoes God exist? Yes, as long as we value perfection but don’t strive for it through self reflection, God will exist. Otherwise who else can be perfect? I don’t know a human like that."},"who-are-they":{"title":"Who are they?","description":"","content":"From the beginning of its existence, human communities have been engaged in conflicts, often culminating in outright wars. Ever since humans have started thinking, they have always created a boundary demarcating ‘us’ and ‘they’. ‘Us’ is our community, and ‘they’ are not a part of our community. Thus, started the story of disharmony of humans. Humans divided themselves on the basis of region, language, color and culture. In modern times we see such divisions in the form of nations, races, and ethnicity. But what is so different about ‘them’ that we have always separated them from ‘us’. They too are humans like us, but this ‘common identity’ seems to be insufficient to overcome the differences.\nWho are ‘they’, asks a four year child to her mother. ‘They’ are not like us, keep away from ‘them’, replied her mother. This is the story of ‘the boundary’ that permeates generations.\nThis is not surprising. Human nature has been like this since it started to walk on two legs. Even if humans somehow miraculously overcome these differences among them, the other animals will be treated as ‘they’. If even ‘they’ become ‘us’, poor plants will take the role of ‘they’. Further, if God is in really good mood, and humans realize the harmony of life, humans would ask, “who are ‘they’ living on other planets?”\nWhat is not clear, is, why are we like this? Why do humans fail to see the larger identity. Why do we need to demarcate ourselves from the rest. Is it due to limited resources? Is it due to a false notion of superiority? Or, is it something else?\nGreed\nIt is greed – the desire to have more than your need. We believe about others, what we are sure about ourselves. If a community kills other communities for resources, it has all the reasons to believe that others too will do so. Harmony cannot exist where there is greed. Every human community wants the maximum resources for itself, without worrying about the others. Thus. some communities have become so resourceful that just by being born in them you can be sure of a luxurious life. Others, are so poor, that being born in them could have been a curse of previous life.\nBut why is greed so human?\nLion is often called the king of the jungle. Have you seen a lion hunting with a full tummy? Perhaps, it is because lions are not ‘intelligent’ enough to care to accumulate resources for the future. It is such a stupid animal that it hunts, only when it is hungry. If it gets a good hunt, then this stupid animal will sleep for days, doing nothing, but just enjoying life. But we humans have intelligence and we care not just for our present needs, but for future needs as well. We constantly try to accumulate more than what we can consume today.\nWe need resources for future, so what if ‘they’ don’t have resources for present. After all, ‘they’ are not ‘us’."},"who-is-rational":{"title":"Who is rational?","description":"","content":"Having a peek at the people at large would reveal that people are not naturally capable of being rational. Emotions always overtake rationality. Even the people who proudly flaunt themselves as rationalists are too emotionally attached to rationality.\nEven centuries after the rise of rationality there is no academic or intellectual consensus on plaguing issues. This proves that there are always more than one perspective to look at issues. People will be emotionally attached to one of the perspectives, and even will use rationality to establish that perspective as superior to others.\nThen why celebrate the pretentious drama of rationality, when in the end, we reach the same place – subjective understanding of our objective reality.\nAnd is it rational to be rational when it yields nothing?"}}